# Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница.
# Петя помогает Кате по математике.
# Он задумывает два натуральных числа X и Y (X,Y ≤ 1000), а Катя должна их отгадать.
# Для этого Петя делает две подсказки.
# Он называет сумму этих чисел S и их произведение P.
# Помогите Кате отгадать задуманные Петей числа.
# 5, 6 -> 2, 3

# s = a + b 
# p = a * b 

# a = s - b
# a = p / b
# s = p / b + b
# b = s - (p / b)
# p / b + b - s = 0
# p + b*b - s*b = 0
# b * b - s * b + p = 0
# D = b^2 - 4*a*c
# d = s * s - 4 * 1 * p
# b_1 = (s + d ** 0.5) / 2
# b_2 = (s - d ** 0.5) / 2
# a_1 = s - b_1
# a_2 = s - b_2

s = int(input('Enter S number: '))
p = int(input('Enter P number: '))
d = s * s - 4 * 1 * p
b_1 = (s + d ** 0.5) / 2
b_2 = (s - d ** 0.5) / 2
a_1 = s - b_1
a_2 = s - b_2
if a_1 + b_1 == s and a_1 * b_1 == p:
    print(f'{s}, {p} -> {a_1}, {b_1}')
elif a_2 + b_2 == s and a_2 * b_2 == p:
    print(f'{s}, {p} -> {a_2}, {b_2}')
else:
    print('s and p are incompatible')